; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; 4 Op-blocks world
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain BLOCKS)
  (:requirements :strips)
  (:predicates (on ?x ?y)
	       (ontable ?x)
	       (clear ?x)
	       (handempty)
	       (holding ?x)
	       )

  (:action pick-up
	     :parameters (?x)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x ?y)
	     :precondition (and (holding ?x) (clear ?y))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x ?y)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y)))))

; problem
(define (problem BLOCKS-7-1)
(:domain BLOCKS)
(:objects DUMMY E B D F G C A - block)
(:INIT (CLEAR A) (CLEAR C) (ONTABLE G) (ONTABLE F) (ON A G) (ON C D) (ON D B)
 (ON B E) (ON E F) (HANDEMPTY))
(:goal (AND (ON A E) (ON E B) (ON B F) (ON F G) (ON G C) (ON C D)))
)

; plan
1. (unstack c d)
   deleted: (clear c) (handempty) (on c d)
   added: (holding c) (clear d)
   goals met: 0 of 6
2. (put-down c)
   deleted: (holding c)
   added: (clear c) (handempty) (ontable c)
   goals met: 0 of 6
3. (unstack a g)
   deleted: (clear a) (handempty) (on a g)
   added: (holding a) (clear g)
   goals met: 0 of 6
4. (put-down a)
   deleted: (holding a)
   added: (clear a) (handempty) (ontable a)
   goals met: 0 of 6
5. (unstack d b)
   deleted: (clear d) (handempty) (on d b)
   added: (holding d) (clear b)
   goals met: 0 of 6
6. (put-down d)
   deleted: (holding d)
   added: (clear d) (handempty) (ontable d)
   goals met: 0 of 6
7. (pick-up c)
   deleted: (ontable c) (clear c) (handempty)
   added: (holding c)
   goals met: 0 of 6
8. (stack c d)
   deleted: (holding c) (clear d)
   added: (clear c) (handempty) (on c d)
   goals met: 1 of 6
9. (pick-up g)
   deleted: (ontable g) (clear g) (handempty)
   added: (holding g)
   goals met: 1 of 6
10. (stack g c)
   deleted: (holding g) (clear c)
   added: (clear g) (handempty) (on g c)
   goals met: 2 of 6
11. (unstack b e)
   deleted: (clear b) (handempty) (on b e)
   added: (holding b) (clear e)
   goals met: 2 of 6
12. (put-down b)
   deleted: (holding b)
   added: (clear b) (handempty) (ontable b)
   goals met: 2 of 6
13. (unstack e f)
   deleted: (clear e) (handempty) (on e f)
   added: (holding e) (clear f)
   goals met: 2 of 6
14. (stack e b)
   deleted: (holding e) (clear b)
   added: (clear e) (handempty) (on e b)
   goals met: 3 of 6
15. (pick-up f)
   deleted: (ontable f) (clear f) (handempty)
   added: (holding f)
   goals met: 3 of 6
16. (stack f g)
   deleted: (holding f) (clear g)
   added: (clear f) (handempty) (on f g)
   goals met: 4 of 6
17. (unstack e b)
   deleted: (clear e) (handempty) (on e b)
   added: (holding e) (clear b)
   goals met: 3 of 6
18. (put-down e)
   deleted: (holding e)
   added: (clear e) (handempty) (ontable e)
   goals met: 3 of 6
19. (pick-up b)
   deleted: (ontable b) (clear b) (handempty)
   added: (holding b)
   goals met: 3 of 6
20. (stack b f)
   deleted: (holding b) (clear f)
   added: (clear b) (handempty) (on b f)
   goals met: 4 of 6
21. (pick-up e)
   deleted: (ontable e) (clear e) (handempty)
   added: (holding e)
   goals met: 4 of 6
22. (stack e b)
   deleted: (holding e) (clear b)
   added: (clear e) (handempty) (on e b)
   goals met: 5 of 6
23. (pick-up a)
   deleted: (ontable a) (clear a) (handempty)
   added: (holding a)
   goals met: 5 of 6
24. (stack a e)
   deleted: (holding a) (clear e)
   added: (clear a) (handempty) (on a e)
   goals met: 6 of 6
